controllers/LanguageController.php

    public function actionIndex()
    {

        $lang = Language:: find()->all();
---
SELECT * FROM `language`

    public function actionView($id)
    {
    	$lang = Language::find()
    	->where(['id_language'=> $id])
    	->one();
---
SELECT * FROM `language` WHERE `id_language`='2'